Conf.Simple/src/InformationRegisters/SUI_docs_tbl_goods/SUI_docs_tbl_goods.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_docs_tbl_goods</name>
  <resources>
    <name>additional_details</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>id_cell</name>
    <comment>Ячейка</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_good</name>
    <comment>Номенклатура</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_price</name>
    <comment>Вид цены</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_properties</name>
    <comment>Характеристика</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_series</name>
    <comment>Серия</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_unit</name>
    <comment>Упаковка</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>price</name>
    <comment>Цена</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>qtty</name>
    <comment>Количество (факт)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>qtty_plan</name>
    <comment>Количество (план)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>use_mark</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>use_series</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>last_updated</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТаблицы</name>
    <type>
      <types>EnumRef.SUI_ТипыТаблицДокументовОбмена</types>
    </type>
  </attributes>
  <dimensions>
    <name>sid</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>sid_doc</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/Enums/SUI_ТипыТаблицДокументовОбмена/SUI_ТипыТаблицДокументовОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SUI_ТипыТаблицДокументовОбмена</name>
  <enumValues>
    <name>Отбор</name>
  </enumValues>
  <enumValues>
    <name>Размещение</name>
  </enumValues>
  <enumValues>
    <name>Товары</name>
  </enumValues>
  <enumValues>
    <name>ШтрихкодыУпаковок</name>
  </enumValues>
  <enumValues>
    <name>ПотокШтрихкодов</name>
  </enumValues>
  <enumValues>
    <name>Серии</name>
  </enumValues>
</mdclass:Enum>

Conf.Simple/src/InformationRegisters/SUI_docs_tbl_goods/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьТаблицуЭталон() Экспорт
	
	Таблица = Новый ТаблицаЗначений();
	
	Для Каждого Колонка Из SUI_ДокументыОбменаПовтИсп.КолонкиТаблицыТовары() Цикл
		Таблица.Колонки.Добавить(Колонка.Имя, Колонка.Тип, Колонка.Заголовок);
	КонецЦикла;
	
	Возврат Таблица;
	
КонецФункции

Функция ЗагрузитьИзМобильногоУстройства(ИдентификаторДокументаОбмена, ЗагружаемаяТаблица) Экспорт
	
	Если ЗагружаемаяТаблица.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗагружаемаяТаблица", ЗагружаемаяТаблица);
	Запрос.УстановитьПараметр("ИдентификаторДокументаОбмена", ИдентификаторДокументаОбмена);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗагружаемаяТаблица.id_good,
		|	ЗагружаемаяТаблица.id_properties,
		|	ЗагружаемаяТаблица.id_series,
		|	ЗагружаемаяТаблица.id_cell,
		|	ЗагружаемаяТаблица.id_unit,
		|	ЗагружаемаяТаблица.id_price,
		|	ЗагружаемаяТаблица.price,
		|	ЗагружаемаяТаблица.qtty КАК qtty,
		|	ЗагружаемаяТаблица.use_series,
		|	ЗагружаемаяТаблица.use_mark,
		|	ЗагружаемаяТаблица.ТипТаблицы
		|ПОМЕСТИТЬ втЗагружаемаяТаблица
		|ИЗ
		|	&ЗагружаемаяТаблица КАК ЗагружаемаяТаблица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыДокументаОбмена.sid,
		|	ТоварыДокументаОбмена.sid_doc,
		|	ТоварыДокументаОбмена.id_good,
		|	ТоварыДокументаОбмена.id_properties,
		|	ТоварыДокументаОбмена.id_series,
		|	ТоварыДокументаОбмена.id_cell,
		|	ТоварыДокументаОбмена.id_unit,
		|	ТоварыДокументаОбмена.id_price,
		|	ТоварыДокументаОбмена.price,
		|	ТоварыДокументаОбмена.qtty_plan,
		|	ТоварыДокументаОбмена.use_series,
		|	ТоварыДокументаОбмена.use_mark,
		|	ТоварыДокументаОбмена.additional_details КАК additional_details,
		|	ТоварыДокументаОбмена.last_updated КАК last_updated,
		|	ТоварыДокументаОбмена.ТипТаблицы
		|ПОМЕСТИТЬ втТоварыДокументаОбмена
		|ИЗ
		|	РегистрСведений.SUI_docs_tbl_goods КАК ТоварыДокументаОбмена
		|ГДЕ
		|	ТоварыДокументаОбмена.sid_doc = &ИдентификаторДокументаОбмена
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ТоварыДокументаОбмена.sid, """") КАК sid,
		|	&ИдентификаторДокументаОбмена КАК sid_doc,
		|	ЕСТЬNULL(ТоварыДокументаОбмена.id_good, втЗагружаемаяТаблица.id_good) КАК id_good,
		|	ЕСТЬNULL(ТоварыДокументаОбмена.id_properties, втЗагружаемаяТаблица.id_properties) КАК id_properties,
		|	ЕСТЬNULL(ТоварыДокументаОбмена.id_series, втЗагружаемаяТаблица.id_series) КАК id_series,
		|	ЕСТЬNULL(ТоварыДокументаОбмена.id_cell, втЗагружаемаяТаблица.id_cell) КАК id_cell,
		|	ЕСТЬNULL(ТоварыДокументаОбмена.id_unit, втЗагружаемаяТаблица.id_unit) КАК id_unit,
		|	ЕСТЬNULL(ТоварыДокументаОбмена.id_price, втЗагружаемаяТаблица.id_price) КАК id_price,
		|	ЕСТЬNULL(ТоварыДокументаОбмена.price, втЗагружаемаяТаблица.price) КАК price,
		|	втЗагружаемаяТаблица.qtty КАК qtty,
		|	ЕСТЬNULL(ТоварыДокументаОбмена.qtty_plan, 0) КАК qtty_plan,
		|	ЕСТЬNULL(ТоварыДокументаОбмена.use_series, втЗагружаемаяТаблица.use_series) КАК use_series,
		|	ЕСТЬNULL(ТоварыДокументаОбмена.use_mark, ЛОЖЬ) КАК use_mark,
		|	ЕСТЬNULL(ТоварыДокументаОбмена.additional_details, """") КАК additional_details,
		|	ЕСТЬNULL(ТоварыДокументаОбмена.last_updated, ДАТАВРЕМЯ(1, 1, 1)) КАК last_updated,
		|	ЕСТЬNULL(ТоварыДокументаОбмена.ТипТаблицы, втЗагружаемаяТаблица.ТипТаблицы) КАК ТипТаблицы
		|ИЗ
		|	втЗагружаемаяТаблица КАК втЗагружаемаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ втТоварыДокументаОбмена КАК ТоварыДокументаОбмена
		|		ПО втЗагружаемаяТаблица.id_good = ТоварыДокументаОбмена.id_good
		|		И втЗагружаемаяТаблица.id_properties = ТоварыДокументаОбмена.id_properties
		|		И втЗагружаемаяТаблица.id_series = ТоварыДокументаОбмена.id_series
		|		И втЗагружаемаяТаблица.id_cell = ТоварыДокументаОбмена.id_cell
		|		И втЗагружаемаяТаблица.id_unit = ТоварыДокументаОбмена.id_unit
		|		И втЗагружаемаяТаблица.id_price = ТоварыДокументаОбмена.id_price
		|		И втЗагружаемаяТаблица.ТипТаблицы = ТоварыДокументаОбмена.ТипТаблицы";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.SUI_docs_tbl_goods");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("sid", "sid");
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("sid_doc", "sid_doc");
		Блокировка.Заблокировать();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Запись = СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
			
			Если ПустаяСтрока(Запись.sid) Тогда
				
				Если Не SUI_ИнтеграцияВКонфигурациюКлиентСервер.ЭтоИдентификаторSimple(Запись.id_good) Тогда
					
					ДанныеСтрокой = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Выборка);
					ДанныеСтрокой = ОбщегоНазначения.ЗначениеВСтрокуXML(ДанныеСтрокой);
					
					ТекстОшибки = НСтр("ru = 'Идентификатор номенклатуры не является идентификатором Simple.
					|%1'");
					ТекстОшибки = СтрШаблон(ТекстОшибки, ДанныеСтрокой);
					
					ВызватьИсключение ТекстОшибки;
					
				КонецЕсли;
				
				Если Запись.ТипТаблицы <> Перечисления.SUI_ТипыТаблицДокументовОбмена.Товары И
					Запись.ТипТаблицы <> Перечисления.SUI_ТипыТаблицДокументовОбмена.Отбор И
					Запись.ТипТаблицы <> Перечисления.SUI_ТипыТаблицДокументовОбмена.Размещение Тогда
					
					ДанныеСтрокой = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Выборка);
					ДанныеСтрокой = ОбщегоНазначения.ЗначениеВСтрокуXML(ДанныеСтрокой);
					
					ТекстОшибки = НСтр("ru = 'Не верный тип таблицы.
					|%1'");
					ТекстОшибки = СтрШаблон(ТекстОшибки, ДанныеСтрокой);
					
					ВызватьИсключение ТекстОшибки;
					
				КонецЕсли;
				
				Запись.sid = Новый УникальныйИдентификатор();
				
			КонецЕсли;
			
			Запись.ДатаОбновления = ТекущаяДатаСеанса();
			
			Запись.Записать(Истина);
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение(НСтр("ru = 'Не удалось загрузить товары документа обмена!'"), , , , ИнформацияОбОшибке());
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
